tutorials/2WayCouplingOceanWave3D/submergedBarResults180625/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         30.00;
//endTime         1.02;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.25;

maxAlphaCo      0.25;

maxDeltaT       1;

//libs ( "libwaves2FoamAdditionals.so" "libwaves2FoamProcessingAdditionals.so" );

functions
{
#includeIfPresent "../waveGaugesNProbes/surfaceElevation_controlDict";
/*    surfaceElevation
    {
        type               surfaceElevation;
        functionObjectLibs ( "libwaves2Foam.so" );

        outputControl      timeStep; // Alternative: outputTime
        outputInterval     1;

        //Additional output controls in waves2Foam
        samplingStartTime  -1;
        surfaceSampleDeltaT 0.025;

        setFormat          raw;
        interpolationScheme cellPointFace;
        fields (alpha1);

        #includeIfPresent "../waveGaugesNProbes/surfaceElevation_sets";

    }*/
}

// ************************************************************************* //
